{"id": "21e60bb0-bc3f-11ee-995e-69549c1dc8c9","name": "Successful User Account Logon (RestricteedAdminMode Disabled)","tags": ["win-sec"],"interval": "1m","enabled": false,"revision": 1,"description": "This rule detects successful remote interactive logons without the /restrictedAdmin flag enabled. Monitoring these events helps ensure that user credentials are not transferred or stored in the target host's memory, enhancing security by enforcing the use of Restricted Admin Mode.","risk_score": 73,"severity": "high","license": "https://github.com/SigmaHQ/Detection-Rule-License/blob/main/LICENSE.Detection.Rules.md","output_index": "","meta": {},"timestamp_override": "event.created","timestamp_override_fallback_disabled": false,"investigation_fields": [],"author": ["celeroon"],"false_positives": [],"from": "now-1m","rule_id": "981b9e3e-6468-4fb4-beb1-33a15ba2574a","max_signals": 100,"risk_score_mapping": [],"severity_mapping": [],"threat": [{"framework": "MITRE ATT&CK","tactic": {"id": "TA0001","reference": "https://attack.mitre.org/tactics/TA0001","name": "Initial Access"},"technique": [{"id": "T1078","reference": "https://attack.mitre.org/techniques/T1078","name": "Valid Accounts","subtechnique": [{"id": "T1078.002","reference": "https://attack.mitre.org/techniques/T1078/002","name": "Domain Accounts"},{"id": "T1078.001","reference": "https://attack.mitre.org/techniques/T1078/001","name": "Default Accounts"}]}]}],"to": "now","references": ["https://labs.withsecure.com/publications/undisable","https://learn.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4624#security-monitoring-recommendations"],"version": 1,"exceptions_list": [],"immutable": false,"related_integrations": [],"required_fields": [],"setup": "","type": "query","language": "lucene","index": ["winlogbeat-*"],"query": "event.code: \"4624\" AND winlog.event_data.LogonType: \"10\" AND winlog.event_data.RestrictedAdminMode: \"%%1843\"","filters": [],"actions": []}