{"name": "Successfully Created User Account (PrimaryGroupId Field Anomaly)","tags": ["win-sec"],"interval": "1m","enabled": false,"revision": 0,"description": "This rule generates an alert when the Primary Group value for domain or local users deviates from the typical value of 513. ","risk_score": 21,"severity": "low","license": "https://github.com/SigmaHQ/Detection-Rule-License/blob/main/LICENSE.Detection.Rules.md","output_index": "","meta": {},"timestamp_override": "event.created","timestamp_override_fallback_disabled": false,"author": ["celeroon"],"false_positives": [],"from": "now-1m","rule_id": "c212605f-4fe7-4164-b180-df0ed588a907","max_signals": 100,"risk_score_mapping": [],"severity_mapping": [],"threat": [{"framework": "MITRE ATT&CK","tactic": {"id": "TA0003","name": "Persistence","reference": "https://attack.mitre.org/tactics/TA0003"},"technique": [{"id": "T1078","name": "Valid Accounts","reference": "https://attack.mitre.org/techniques/T1078","subtechnique": [{"id": "T1078.002","name": "Domain Accounts","reference": "https://attack.mitre.org/techniques/T1078/002"},{"id": "T1078.001","name": "Default Accounts","reference": "https://attack.mitre.org/techniques/T1078/001"}]}]}],"to": "now","references": ["https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-10/security/threat-protection/auditing/event-4720"],"version": 1,"exceptions_list": [],"immutable": false,"related_integrations": [],"required_fields": [],"setup": "","type": "query","language": "kuery","index": ["winlogbeat-*"],"query": "event.code: 4720 AND NOT winlog.event_data.PrimaryGroupId: 513","filters": [],"actions": []}