{"name": "Successfully Created User Account (Server Trust Account Enabled)","tags": ["win-sec"],"interval": "1m","enabled": false,"revision": 0,"description": "This rule triggers an alert when the Server Trust Account Enabled flag is set for a newly created user account. This flag should never be enabled for user accounts, as it is intended exclusively for domain controller (computer) accounts.","risk_score": 21,"severity": "low","license": "https://github.com/SigmaHQ/Detection-Rule-License/blob/main/LICENSE.Detection.Rules.md","output_index": "","meta": {},"timestamp_override": "event.created","timestamp_override_fallback_disabled": false,"author": ["celeroon"],"false_positives": [],"from": "now-60s","rule_id": "faa04015-dc07-4d36-9204-f387b2bd9de3","max_signals": 100,"risk_score_mapping": [],"severity_mapping": [],"threat": [{"framework": "MITRE ATT&CK","tactic": {"id": "TA0003","name": "Persistence","reference": "https://attack.mitre.org/tactics/TA0003"},"technique": [{"id": "T1078","name": "Valid Accounts","reference": "https://attack.mitre.org/techniques/T1078","subtechnique": [{"id": "T1078.002","name": "Domain Accounts","reference": "https://attack.mitre.org/techniques/T1078/002"}]}]}],"to": "now","references": ["https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-10/security/threat-protection/auditing/event-4720"],"version": 1,"exceptions_list": [],"immutable": false,"related_integrations": [],"required_fields": [],"setup": "","type": "query","language": "lucene","index": ["winlogbeat-*"],"query": "event.code: 4720 AND winlog.event_data.UserAccountControl: *%%2088*","filters": [],"actions": []}