{"name": "Successfully Created User Account (AccountExpires Field Anomaly)","tags": ["win-sec"],"interval": "1m","enabled": false,"revision": 0,"description": "This rule triggers an alert when the Account Expires field for a newly created user account is set to any value other than <never> (%%1794). For manually created accounts, this field is usually set to <never> by default. Any deviation may indicate a misconfiguration or potential security risk, such as the unauthorized setting of an account expiration date. Monitoring this field ensures that accounts are not configured with unexpected expiration dates, which could disrupt normal access or indicate malicious intent.","risk_score": 21,"severity": "low","license": "https://github.com/SigmaHQ/Detection-Rule-License/blob/main/LICENSE.Detection.Rules.md","output_index": "","meta": {},"timestamp_override": "event.created","timestamp_override_fallback_disabled": false,"author": ["celeroon"],"false_positives": [],"from": "now-60s","rule_id": "99608d89-3379-48df-9272-ad384966061a","max_signals": 100,"risk_score_mapping": [],"severity_mapping": [],"threat": [{"framework": "MITRE ATT&CK","tactic": {"id": "TA0003","name": "Persistence","reference": "https://attack.mitre.org/tactics/TA0003"},"technique": [{"id": "T1078","name": "Valid Accounts","reference": "https://attack.mitre.org/techniques/T1078","subtechnique": [{"id": "T1078.003","name": "Local Accounts","reference": "https://attack.mitre.org/techniques/T1078/003"},{"id": "T1078.002","name": "Domain Accounts","reference": "https://attack.mitre.org/techniques/T1078/002"}]}]}],"to": "now","references": ["https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-10/security/threat-protection/auditing/event-4720"],"version": 1,"exceptions_list": [],"immutable": false,"related_integrations": [],"required_fields": [],"setup": "","type": "query","language": "lucene","index": ["winlogbeat-*"],"query": "event.code: 4720 AND NOT winlog.event_data.AccountExpires: (\"-\" OR \"%%1794\")","filters": [],"actions": []}