{"name": "Successfully Created User Account (SidHistory Field Anomaly)","tags": ["win-sec"],"interval": "1m","enabled": false,"revision": 0,"description": "This rule triggers an alert when the SidHistory field for a newly created local user account is set to any value other than -. Since this field should only contain a value if the account was migrated from another domain, any deviation could indicate unauthorized activity or account tampering. Monitoring this field is essential to ensure that local accounts are not improperly configured or compromised.","risk_score": 21,"severity": "low","license": "https://github.com/SigmaHQ/Detection-Rule-License/blob/main/LICENSE.Detection.Rules.md","output_index": "","meta": {},"timestamp_override": "event.created","timestamp_override_fallback_disabled": false,"author": ["celeroon"],"false_positives": [],"from": "now-60s","rule_id": "d7eb45be-bd69-4205-bed6-bcaa25aff196","max_signals": 100,"risk_score_mapping": [],"severity_mapping": [],"threat": [{"framework": "MITRE ATT&CK","tactic": {"id": "TA0003","name": "Persistence","reference": "https://attack.mitre.org/tactics/TA0003"},"technique": [{"id": "T1078","name": "Valid Accounts","reference": "https://attack.mitre.org/techniques/T1078","subtechnique": [{"id": "T1078.003","name": "Local Accounts","reference": "https://attack.mitre.org/techniques/T1078/003"},{"id": "T1078.002","name": "Domain Accounts","reference": "https://attack.mitre.org/techniques/T1078/002"}]}]}],"to": "now","references": ["https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-10/security/threat-protection/auditing/event-4720"],"version": 1,"exceptions_list": [],"immutable": false,"related_integrations": [],"required_fields": [],"setup": "","type": "query","language": "kuery","index": ["winlogbeat-*"],"query": "event.code: 4720 AND NOT winlog.event_data.SidHistory: \"-\"","filters": [],"actions": []}