{"name": "Successfully Created User Account (LogonHours Field Anomaly)","tags": ["win-sec"],"interval": "1m","enabled": false,"revision": 0,"description": "This rule triggers an alert when the LogonHours field for a newly created user account does not match the expected values. For domain user accounts, this field should be <value not set>. For local user accounts, it should be All (%%1797). Any other value may suggest unauthorized changes or misconfigurations that could impact account security. Monitoring this field helps ensure that logon restrictions are correctly applied according to policy.","risk_score": 21,"severity": "low","license": "https://github.com/SigmaHQ/Detection-Rule-License/blob/main/LICENSE.Detection.Rules.md","output_index": "","meta": {},"timestamp_override": "event.created","timestamp_override_fallback_disabled": false,"author": ["celeroon"],"false_positives": [],"from": "now-61s","rule_id": "7aba9a4a-c4c3-4195-831f-ac418f86bd8c","max_signals": 100,"risk_score_mapping": [],"severity_mapping": [],"threat": [{"framework": "MITRE ATT&CK","tactic": {"id": "TA0003","name": "Persistence","reference": "https://attack.mitre.org/tactics/TA0003"},"technique": [{"id": "T1078","name": "Valid Accounts","reference": "https://attack.mitre.org/techniques/T1078","subtechnique": [{"id": "T1078.003","name": "Local Accounts","reference": "https://attack.mitre.org/techniques/T1078/003"},{"id": "T1078.002","name": "Domain Accounts","reference": "https://attack.mitre.org/techniques/T1078/002"}]}]}],"to": "now","references": ["https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-10/security/threat-protection/auditing/event-4720"],"version": 1,"exceptions_list": [],"immutable": false,"related_integrations": [],"required_fields": [],"setup": "","type": "query","language": "kuery","index": ["winlogbeat-*"],"query": "event.code: 4720 AND NOT winlog.event_data.LogonHours: (\"%%1797\" OR \"%%1793\")","filters": [],"actions": []}