{"id": "187bf580-b20d-11ee-acc3-b1d2486e3cff","name": "User Account Logon Failure (0xC000015B)","tags": ["win-sec"],"interval": "1m","enabled": false,"revision": 0,"description": "This rule detects failed logon attempts due to the user not being granted the requested logon type on the machine (error code 0xC000015B). This helps identify instances where users attempt to access systems with insufficient privileges, enhancing security by enforcing proper access controls.","risk_score": 21,"severity": "low","license": "https://github.com/SigmaHQ/Detection-Rule-License/blob/main/LICENSE.Detection.Rules.md","output_index": "","meta": {},"investigation_fields": [],"timestamp_override": "event.created","timestamp_override_fallback_disabled": false,"author": ["celeroon (Microsoft's based docs)"],"false_positives": [],"from": "now-1m","rule_id": "531f37a3-9b58-4c40-9873-be2554998317","max_signals": 100,"risk_score_mapping": [],"severity_mapping": [],"threat": [{"framework": "MITRE ATT&CK","tactic": {"id": "TA0006","name": "Credential Access","reference": "https://attack.mitre.org/tactics/TA0006"},"technique": [{"id": "T1110","name": "Brute Force","reference": "https://attack.mitre.org/techniques/T1110","subtechnique": []}]}],"to": "now","references": [],"version": 1,"exceptions_list": [],"immutable": false,"related_integrations": [],"required_fields": [],"setup": "","type": "query","language": "lucene","index": ["winlogbeat-*"],"query": "event.code: \"4625\" AND winlog.event_data.SubStatus: /0[xX][cC]000015[bB]/ AND winlog.event_data.FailureReason: \"%%2308\"","filters": [],"actions": []}