{"id": "e27755c0-b20b-11ee-acc3-b1d2486e3cff","name": "User Account Logon Failure (0xC0000070)","tags": ["win-sec"],"interval": "1m","enabled": false,"revision": 0,"description": "This rule detects failed logon attempts when a user is not allowed to log on at a specific computer (error code 0xC0000070). It helps enforce security policies by identifying and preventing unauthorized access attempts on restricted machines.","risk_score": 21,"severity": "low","license": "https://github.com/SigmaHQ/Detection-Rule-License/blob/main/LICENSE.Detection.Rules.md","output_index": "","meta": {},"investigation_fields": [],"timestamp_override": "event.created","timestamp_override_fallback_disabled": false,"author": ["celeroon (Microsoft's based docs)"],"false_positives": [],"from": "now-1m","rule_id": "267d2520-64cd-4e0d-a630-c821b27f7359","max_signals": 100,"risk_score_mapping": [],"severity_mapping": [],"threat": [{"framework": "MITRE ATT&CK","tactic": {"id": "TA0006","name": "Credential Access","reference": "https://attack.mitre.org/tactics/TA0006"},"technique": [{"id": "T1110","name": "Brute Force","reference": "https://attack.mitre.org/techniques/T1110","subtechnique": []}]}],"to": "now","references": [],"version": 1,"exceptions_list": [],"immutable": false,"related_integrations": [],"required_fields": [],"setup": "","type": "query","language": "lucene","index": ["winlogbeat-*"],"query": "event.code: \"4625\" AND winlog.event_data.SubStatus: /0[xX][cC]0000070/ AND winlog.event_data.FailureReason: \"%%2312\"","filters": [],"actions": []}