{"id": "04eeb730-33e7-11ef-a6a2-4f3c5f6bf300","name": "Successfully Created User Account (SAMAccountName Field Anomaly)","tags": ["win-sec"],"interval": "1m","enabled": false,"revision": 0,"description": "The SAMAccountName field must contain the user account name. An empty or \"-\" value may indicate a potential anomaly.","risk_score": 47,"severity": "medium","license": "https://github.com/SigmaHQ/Detection-Rule-License/blob/main/LICENSE.Detection.Rules.md","output_index": "","meta": {},"timestamp_override": "event.created","timestamp_override_fallback_disabled": false,"investigation_fields": [],"author": ["celeroon"],"false_positives": [],"from": "now-1m","rule_id": "72badf78-a7c5-4ac0-9b34-f9bd27e444a5","max_signals": 100,"risk_score_mapping": [],"severity_mapping": [],"threat": [{"framework": "MITRE ATT&CK","tactic": {"id": "TA0003","reference": "https://attack.mitre.org/tactics/TA0003","name": "Persistence"},"technique": [{"id": "T1136","reference": "https://attack.mitre.org/techniques/T1136","name": "Create Account","subtechnique": [{"id": "T1087.001","reference": "https://attack.mitre.org/techniques/T1087/001","name": "Local Account"},{"id": "T1087.002","reference": "https://attack.mitre.org/techniques/T1087/002","name": "Domain Account"}]}]}],"to": "now","references": ["https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-10/security/threat-protection/auditing/event-4720#security-monitoring-recommendations "],"version": 1,"exceptions_list": [],"immutable": false,"related_integrations": [],"required_fields": [],"setup": "","type": "query","language": "lucene","index": ["winlogbeat-*"],"query": "event.code: \"4720\" AND winlog.event_data.SamAccountName: (\"-\" OR \"\")","filters": [],"actions": []}