{"id": "d56d5200-bf7e-11ee-995e-69549c1dc8c9","name": "User Account Logon Success (Old NTLM Version)","tags": ["win-sec"],"interval": "1m","enabled": false,"revision": 2,"description": "This rule detects successful logons using older versions of NTLM authentication. Monitoring for the use of outdated NTLM versions helps identify potential security risks, as older versions are less secure compared to NTLMv2. This ensures the use of stronger, more secure authentication methods.","risk_score": 21,"severity": "low","license": "https://github.com/SigmaHQ/Detection-Rule-License/blob/main/LICENSE.Detection.Rules.md","output_index": "","meta": {},"timestamp_override": "event.created","timestamp_override_fallback_disabled": false,"investigation_fields": [],"author": ["celeroon"],"false_positives": [],"from": "now-1m","rule_id": "84788a74-e878-4a79-abd0-c77f5495d3e4","max_signals": 100,"risk_score_mapping": [],"severity_mapping": [],"threat": [{"tactic": {"id": "TA0001","reference": "https://attack.mitre.org/tactics/TA0001","name": "Initial Access"},"framework": "MITRE ATT&CK","technique": [{"id": "T1078","reference": "https://attack.mitre.org/techniques/T1078","name": "Valid Accounts","subtechnique": [{"id": "T1078.003","reference": "https://attack.mitre.org/techniques/T1078/003","name": "Local Accounts"},{"id": "T1078.002","reference": "https://attack.mitre.org/techniques/T1078/002","name": "Domain Accounts"}]}]}],"to": "now","references": ["https://learn.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4624#security-monitoring-recommendations"],"version": 1,"exceptions_list": [],"immutable": false,"related_integrations": [],"required_fields": [],"setup": "","type": "query","language": "kuery","index": ["winlogbeat-*"],"query": "event.code: \"4624\" AND winlog.event_data.AuthenticationPackageName: \"NTLM\" AND NOT winlog.event_data.LmPackageName: \"NTLM V2\"","filters": [],"actions": []}
