{"id": "f5446470-aa5b-11ee-9cc4-15fcbf53097c","name": "User Account Logon Failure (0xC0000072)","tags": ["win-sec"],"interval": "1m","enabled": false,"revision": 0,"description": "This rule detects failed logon attempts when a user attempts to log on with a locked account (error code 0xC0000072). It helps identify and monitor instances of account lockouts, enhancing security by preventing access with locked credentials.","risk_score": 21,"severity": "low","license": "https://github.com/SigmaHQ/Detection-Rule-License/blob/main/LICENSE.Detection.Rules.md","output_index": "","meta": {},"timestamp_override": "event.created","timestamp_override_fallback_disabled": false,"investigation_fields": [],"author": ["celeroon (Microsoft's based docs)"],"false_positives": [],"from": "now-1m","rule_id": "c9299e66-a358-4d73-9335-8ed25402cb0c","max_signals": 100,"risk_score_mapping": [],"severity_mapping": [],"threat": [{"framework": "MITRE ATT&CK","tactic": {"id": "TA0006","name": "Credential Access","reference": "https://attack.mitre.org/tactics/TA0006"},"technique": [{"id": "T1110","name": "Brute Force","reference": "https://attack.mitre.org/techniques/T1110","subtechnique": []}]}],"to": "now","references": [],"version": 1,"exceptions_list": [],"immutable": false,"related_integrations": [],"required_fields": [],"setup": "","type": "query","language": "lucene","index": ["winlogbeat-*"],"query": "event.code: \"4625\" AND winlog.event_data.SubStatus: /0[xX][cC]0000072/","filters": [],"actions": []}