{"id": "e03b10b0-c75c-11ee-995e-69549c1dc8c9","name": "User Account Logon Failure (Suspicious Process)","tags": ["win-sec"],"interval": "1m","enabled": false,"revision": 0,"description": "This rule detects failed logon attempts associated with suspicious process paths. It helps identify potential malicious activity by monitoring logon failures where the process path does not match known legitimate paths, indicating possible unauthorized access attempts or malware presence.","risk_score": 73,"severity": "high","license": "https://github.com/SigmaHQ/Detection-Rule-License/blob/main/LICENSE.Detection.Rules.md","output_index": "","meta": {},"investigation_fields": [],"timestamp_override": "event.created","timestamp_override_fallback_disabled": false,"author": ["celeroon"],"false_positives": [],"from": "now-1m","rule_id": "f58e04cc-4d6c-44fd-b5cb-d041f5289db8","max_signals": 100,"risk_score_mapping": [],"severity_mapping": [],"threat": [{"framework": "MITRE ATT&CK","tactic": {"id": "TA0006","name": "Credential Access","reference": "https://attack.mitre.org/tactics/TA0006"},"technique": [{"id": "T1110","name": "Brute Force","reference": "https://attack.mitre.org/techniques/T1110","subtechnique": []}]}],"to": "now","references": [],"version": 1,"exceptions_list": [],"immutable": false,"related_integrations": [],"required_fields": [],"setup": "","type": "query","language": "lucene","index": ["winlogbeat-*"],"query": "event.code: \"4625\" AND NOT process.executable: \"-\" AND NOT process.executable: (/[cC]:\\\\[wW][iI][nN][dD][oO][wW][sS]\\\\[sS][yY][sS][tT][eE][mM]32\\\\[sS][eE][rR][vV][iI][cC][eE][sS].[eE][xX][eE]/ OR /[cC]:\\\\[wW][iI][nN][dD][oO][wW][sS]\\\\[sS][yY][sS][tT][eE][mM]32\\\\[lL][sS][aA][sS][sS].[eE][xX][eE]/ OR /[cC]:\\\\[wW][iI][nN][dD][oO][wW][sS]\\\\[sS][yY][sS][tT][eE][mM]32\\\\[sS][vV][cC][hH][oO][sS][tT].[eE][xX][eE]/ OR /[cC]:\\\\[wW][iI][nN][dD][oO][wW][sS]\\\\[sS][yY][sS][tT][eE][mM]32\\\\[wW][iI][nN][lL][oO][gG][oO][nN].[eE][xX][eE]/) OR NOT winlog.event_data.ProcessName: (/[cC]:\\\\[wW][iI][nN][dD][oO][wW][sS]\\\\[sS][yY][sS][tT][eE][mM]32\\\\[sS][eE][rR][vV][iI][cC][eE][sS].[eE][xX][eE]/ OR /[cC]:\\\\[wW][iI][nN][dD][oO][wW][sS]\\\\[sS][yY][sS][tT][eE][mM]32\\\\[lL][sS][aA][sS][sS].[eE][xX][eE]/ OR /[cC]:\\\\[wW][iI][nN][dD][oO][wW][sS]\\\\[sS][yY][sS][tT][eE][mM]32\\\\[sS][vV][cC][hH][oO][sS][tT].[eE][xX][eE]/ OR /[cC]:\\\\[wW][iI][nN][dD][oO][wW][sS]\\\\[sS][yY][sS][tT][eE][mM]32\\\\[wW][iI][nN][lL][oO][gG][oO][nN].[eE][xX][eE]/) AND NOT winlog.event_data.ProcessName: \"-\"","filters": [],"actions": []}