{"id": "36342f60-b20e-11ee-acc3-b1d2486e3cff","name": "User Account Logon Failure (0XC0000192)","tags": ["win-sec"],"interval": "1m","enabled": false,"revision": 0,"description": "This rule detects failed logon attempts due to the NetLogon component not being active (error code 0xC0000192). It helps identify issues with the NetLogon service, which is essential for domain authentication, thereby enhancing security by ensuring proper service functionality.","risk_score": 21,"severity": "low","license": "https://github.com/SigmaHQ/Detection-Rule-License/blob/main/LICENSE.Detection.Rules.md","output_index": "","meta": {},"investigation_fields": [],"timestamp_override": "event.created","timestamp_override_fallback_disabled": false,"author": ["celeroon (Microsoft's based docs)"],"false_positives": [],"from": "now-1m","rule_id": "4d715cd8-0f81-48fe-b146-6b50c75678f6","max_signals": 100,"risk_score_mapping": [],"severity_mapping": [],"threat": [{"framework": "MITRE ATT&CK","tactic": {"id": "TA0006","name": "Credential Access","reference": "https://attack.mitre.org/tactics/TA0006"},"technique": [{"id": "T1110","name": "Brute Force","reference": "https://attack.mitre.org/techniques/T1110","subtechnique": []}]}],"to": "now","references": [],"version": 1,"exceptions_list": [],"immutable": false,"related_integrations": [],"required_fields": [],"setup": "","type": "query","language": "lucene","index": ["winlogbeat-*"],"query": "event.code: \"4625\" AND winlog.event_data.SubStatus: /0[xX][cC]0000192/ AND winlog.event_data.FailureReason: \"%%2306\"","filters": [],"actions": []}