{"name": "Successfully Created User Account (By non-Admin Account)","tags": ["win-sec"],"interval": "1m","enabled": false,"revision": 0,"description": "This rule triggers an alert when a new user account is created by a non-admin account. Normally, only accounts with administrative privileges should have the ability to create new user accounts.","risk_score": 73,"severity": "high","license": "https://github.com/SigmaHQ/Detection-Rule-License/blob/main/LICENSE.Detection.Rules.md","output_index": "","meta": {},"timestamp_override": "event.created","timestamp_override_fallback_disabled": false,"author": ["celeroon"],"false_positives": [],"from": "now-60s","rule_id": "14cda749-ef81-47de-b3aa-482511a08adc","max_signals": 100,"risk_score_mapping": [],"severity_mapping": [],"threat": [{"framework": "MITRE ATT&CK","tactic": {"id": "TA0003","name": "Persistence","reference": "https://attack.mitre.org/tactics/TA0003"},"technique": [{"id": "T1078","name": "Valid Accounts","reference": "https://attack.mitre.org/techniques/T1078","subtechnique": [{"id": "T1078.003","name": "Local Accounts","reference": "https://attack.mitre.org/techniques/T1078/003"},{"id": "T1078.002","name": "Domain Accounts","reference": "https://attack.mitre.org/techniques/T1078/002"}]}]}],"to": "now","references": ["https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-10/security/threat-protection/auditing/event-4720"],"version": 1,"exceptions_list": [],"immutable": false,"related_integrations": [],"required_fields": [],"setup": "","type": "query","language": "lucene","index": ["winlogbeat-*"],"query": "event.code: 4720 AND NOT winlog.event_data.SubjectUserName: (\"Administrator\")","filters": [],"actions": []}