{"id": "01584740-b204-11ee-acc3-b1d2486e3cff","name": "User Account Logon Failure (0XC000005E)","tags": ["win-sec"],"interval": "1m","enabled": false,"revision": 0,"description": "This detection rule identifies instances of failed logon attempts due to the unavailability of logon servers. The specific error code 0XC000005E indicates that there are no logon servers available to service the logon request. This condition often arises in environments where Domain Controllers are inaccessible or unresponsive, potentially indicating network issues, server downtime, or misconfigurations.","risk_score": 47,"severity": "medium","license": "https://github.com/SigmaHQ/Detection-Rule-License/blob/main/LICENSE.Detection.Rules.md","output_index": "","meta": {},"investigation_fields": [],"timestamp_override": "event.created","timestamp_override_fallback_disabled": false,"author": ["celeroon"],"false_positives": [],"from": "now-1m","rule_id": "00b36ffb-159a-4c03-9cf5-66f6a8866b16","max_signals": 100,"risk_score_mapping": [],"severity_mapping": [],"threat": [{"framework": "MITRE ATT&CK","tactic": {"id": "TA0006","name": "Credential Access","reference": "https://attack.mitre.org/tactics/TA0006"},"technique": [{"id": "T1110","name": "Brute Force","reference": "https://attack.mitre.org/techniques/T1110","subtechnique": []}]}],"to": "now","references": [],"version": 1,"exceptions_list": [],"immutable": false,"related_integrations": [],"required_fields": [],"setup": "","type": "query","language": "lucene","index": ["winlogbeat-*"],"query": "event.code: \"4625\" AND winlog.event_data.SubStatus: /0[xX][cC]000005[eE]/ AND winlog.event_data.FailureReason: \"%%2304\"","filters": [],"actions": []}