{"id": "328e8070-a97d-11ee-9242-09dd0521d293","name": "User Account Logon Failure (0xC0000193)","tags": ["win-sec"],"interval": "1m","enabled": false,"revision": 0,"description": "This rule detects failed logon attempts when a user tries to log on with an expired account (error code 0xC0000193). It helps identify and monitor instances where users attempt to access the system with accounts that are no longer valid, enhancing security by enforcing account expiration policies.","risk_score": 21,"severity": "low","license": "https://github.com/SigmaHQ/Detection-Rule-License/blob/main/LICENSE.Detection.Rules.md","output_index": "","meta": {},"timestamp_override": "event.created","timestamp_override_fallback_disabled": false,"investigation_fields": [],"author": ["celeroon"],"false_positives": [],"from": "now-1m","rule_id": "556be85d-d954-4f4e-bcc0-29dffae7d687","max_signals": 100,"risk_score_mapping": [],"severity_mapping": [],"threat": [{"framework": "MITRE ATT&CK","tactic": {"id": "TA0006","name": "Credential Access","reference": "https://attack.mitre.org/tactics/TA0006"},"technique": [{"id": "T1110","name": "Brute Force","reference": "https://attack.mitre.org/techniques/T1110","subtechnique": []}]}],"to": "now","references": [],"version": 1,"exceptions_list": [],"immutable": false,"related_integrations": [],"required_fields": [],"setup": "","type": "query","language": "lucene","index": ["winlogbeat-*"],"query": "event.code: \"4625\" AND winlog.event_data.SubStatus: /0[xX][cC]0000193/","filters": [],"actions": []}