{"id": "07d295d0-bf7e-11ee-995e-69549c1dc8c9","name": "User Account Logon Success (Suspicious Source Address)","tags": ["win-sec"],"interval": "1m","enabled": false,"revision": 1,"description": "This rule detects successful logons by specific accounts, such as service accounts, from suspicious or unauthorized source addresses. Monitoring these events helps identify potential unauthorized access from unexpected network locations, enhancing security by ensuring logons occur only from trusted subnets.","risk_score": 73,"severity": "high","license": "https://github.com/SigmaHQ/Detection-Rule-License/blob/main/LICENSE.Detection.Rules.md","output_index": "","meta": {},"timestamp_override": "event.created","timestamp_override_fallback_disabled": false,"investigation_fields": [],"author": ["celeroon"],"false_positives": [],"from": "now-1m","rule_id": "c390c592-d3df-4f57-a952-81cb1bd1f1a5","max_signals": 100,"risk_score_mapping": [],"severity_mapping": [],"threat": [{"tactic": {"id": "TA0001","reference": "https://attack.mitre.org/tactics/TA0001","name": "Initial Access"},"framework": "MITRE ATT&CK","technique": [{"id": "T1078","reference": "https://attack.mitre.org/techniques/T1078","name": "Valid Accounts","subtechnique": [{"id": "T1078.002","reference": "https://attack.mitre.org/techniques/T1078/002","name": "Domain Accounts"},{"id": "T1078.003","reference": "https://attack.mitre.org/techniques/T1078/003","name": "Local Accounts"}]}]}],"to": "now","references": ["https://learn.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4624#security-monitoring-recommendations"],"version": 1,"exceptions_list": [],"immutable": false,"related_integrations": [],"required_fields": [],"setup": "","type": "query","language": "lucene","index": ["winlogbeat-*"],"query": "event.code: \"4624\" AND NOT source.ip: ([10.0.0.0 TO 10.255.255.255] OR [fe80:: TO febf:ffff:ffff:ffff:ffff:ffff:ffff:ffff]) AND NOT source.ip: (\"::1\" OR \"127.0.0.1\") OR NOT winlog.event_data.IpAddress: ([10.0.0.0 TO 10.255.255.255] OR [fe80:: TO febf:ffff:ffff:ffff:ffff:ffff:ffff:ffff]) AND NOT winlog.event_data.IpAddress: (\"::1\" OR \"127.0.0.1\") AND NOT winlog.event_data.IpAddress: \"-\"","filters": [],"actions": []}